GopalSaraf/Practicals/PSDL/include/proc/pic18c658.inc
// Register: BRGCON1
#define BRGCON1 BRGCON1
BRGCON1                                  equ 0F70h
// bitfield definitions
BRGCON1_BRP0_POSN                        equ 0000h
BRGCON1_BRP0_POSITION                    equ 0000h
BRGCON1_BRP0_SIZE                        equ 0001h
BRGCON1_BRP0_LENGTH                      equ 0001h
BRGCON1_BRP0_MASK                        equ 0001h
BRGCON1_BRP1_POSN                        equ 0001h
BRGCON1_BRP1_POSITION                    equ 0001h
BRGCON1_BRP1_SIZE                        equ 0001h
BRGCON1_BRP1_LENGTH                      equ 0001h
BRGCON1_BRP1_MASK                        equ 0002h
BRGCON1_BRP2_POSN                        equ 0002h
BRGCON1_BRP2_POSITION                    equ 0002h
BRGCON1_BRP2_SIZE                        equ 0001h
BRGCON1_BRP2_LENGTH                      equ 0001h
BRGCON1_BRP2_MASK                        equ 0004h
BRGCON1_BRP3_POSN                        equ 0003h
BRGCON1_BRP3_POSITION                    equ 0003h
BRGCON1_BRP3_SIZE                        equ 0001h
BRGCON1_BRP3_LENGTH                      equ 0001h
BRGCON1_BRP3_MASK                        equ 0008h
BRGCON1_BRP4_POSN                        equ 0004h
BRGCON1_BRP4_POSITION                    equ 0004h
BRGCON1_BRP4_SIZE                        equ 0001h
BRGCON1_BRP4_LENGTH                      equ 0001h
BRGCON1_BRP4_MASK                        equ 0010h
BRGCON1_BRP5_POSN                        equ 0005h
BRGCON1_BRP5_POSITION                    equ 0005h
BRGCON1_BRP5_SIZE                        equ 0001h
BRGCON1_BRP5_LENGTH                      equ 0001h
BRGCON1_BRP5_MASK                        equ 0020h
BRGCON1_SJW0_POSN                        equ 0006h
BRGCON1_SJW0_POSITION                    equ 0006h
BRGCON1_SJW0_SIZE                        equ 0001h
BRGCON1_SJW0_LENGTH                      equ 0001h
BRGCON1_SJW0_MASK                        equ 0040h
BRGCON1_SJW1_POSN                        equ 0007h
BRGCON1_SJW1_POSITION                    equ 0007h
BRGCON1_SJW1_SIZE                        equ 0001h
BRGCON1_SJW1_LENGTH                      equ 0001h
BRGCON1_SJW1_MASK                        equ 0080h

// Register: BRGCON2
#define BRGCON2 BRGCON2
BRGCON2                                  equ 0F71h
// bitfield definitions
BRGCON2_PRSEG0_POSN                      equ 0000h
BRGCON2_PRSEG0_POSITION                  equ 0000h
BRGCON2_PRSEG0_SIZE                      equ 0001h
BRGCON2_PRSEG0_LENGTH                    equ 0001h
BRGCON2_PRSEG0_MASK                      equ 0001h
BRGCON2_PRSEG1_POSN                      equ 0001h
BRGCON2_PRSEG1_POSITION                  equ 0001h
BRGCON2_PRSEG1_SIZE                      equ 0001h
BRGCON2_PRSEG1_LENGTH                    equ 0001h
BRGCON2_PRSEG1_MASK                      equ 0002h
BRGCON2_PRSEG2_POSN                      equ 0002h
BRGCON2_PRSEG2_POSITION                  equ 0002h
BRGCON2_PRSEG2_SIZE                      equ 0001h
BRGCON2_PRSEG2_LENGTH                    equ 0001h
BRGCON2_PRSEG2_MASK                      equ 0004h
BRGCON2_SEG1PH0_POSN                     equ 0003h
BRGCON2_SEG1PH0_POSITION                 equ 0003h
BRGCON2_SEG1PH0_SIZE                     equ 0001h
BRGCON2_SEG1PH0_LENGTH                   equ 0001h
BRGCON2_SEG1PH0_MASK                     equ 0008h
BRGCON2_SEG1PH1_POSN                     equ 0004h
BRGCON2_SEG1PH1_POSITION                 equ 0004h
BRGCON2_SEG1PH1_SIZE                     equ 0001h
BRGCON2_SEG1PH1_LENGTH                   equ 0001h
BRGCON2_SEG1PH1_MASK                     equ 0010h
BRGCON2_SEG1PH2_POSN                     equ 0005h
BRGCON2_SEG1PH2_POSITION                 equ 0005h
BRGCON2_SEG1PH2_SIZE                     equ 0001h
BRGCON2_SEG1PH2_LENGTH                   equ 0001h
BRGCON2_SEG1PH2_MASK                     equ 0020h
BRGCON2_SAM_POSN                         equ 0006h
BRGCON2_SAM_POSITION                     equ 0006h
BRGCON2_SAM_SIZE                         equ 0001h
BRGCON2_SAM_LENGTH                       equ 0001h
BRGCON2_SAM_MASK                         equ 0040h
BRGCON2_SEG2PHTS_POSN                    equ 0007h
BRGCON2_SEG2PHTS_POSITION                equ 0007h
BRGCON2_SEG2PHTS_SIZE                    equ 0001h
BRGCON2_SEG2PHTS_LENGTH                  equ 0001h
BRGCON2_SEG2PHTS_MASK                    equ 0080h
BRGCON2_SEG2PHT_POSN                     equ 0007h
BRGCON2_SEG2PHT_POSITION                 equ 0007h
BRGCON2_SEG2PHT_SIZE                     equ 0001h
BRGCON2_SEG2PHT_LENGTH                   equ 0001h
BRGCON2_SEG2PHT_MASK                     equ 0080h

// Register: BRGCON3
#define BRGCON3 BRGCON3
BRGCON3                                  equ 0F72h
// bitfield definitions
BRGCON3_SEG2PH0_POSN                     equ 0000h
BRGCON3_SEG2PH0_POSITION                 equ 0000h
BRGCON3_SEG2PH0_SIZE                     equ 0001h
BRGCON3_SEG2PH0_LENGTH                   equ 0001h
BRGCON3_SEG2PH0_MASK                     equ 0001h
BRGCON3_SEG2PH1_POSN                     equ 0001h
BRGCON3_SEG2PH1_POSITION                 equ 0001h
BRGCON3_SEG2PH1_SIZE                     equ 0001h
BRGCON3_SEG2PH1_LENGTH                   equ 0001h
BRGCON3_SEG2PH1_MASK                     equ 0002h
BRGCON3_SEG2PH2_POSN                     equ 0002h
BRGCON3_SEG2PH2_POSITION                 equ 0002h
BRGCON3_SEG2PH2_SIZE                     equ 0001h
BRGCON3_SEG2PH2_LENGTH                   equ 0001h
BRGCON3_SEG2PH2_MASK                     equ 0004h
BRGCON3_WAKFIL_POSN                      equ 0006h
BRGCON3_WAKFIL_POSITION                  equ 0006h
BRGCON3_WAKFIL_SIZE                      equ 0001h
BRGCON3_WAKFIL_LENGTH                    equ 0001h
BRGCON3_WAKFIL_MASK                      equ 0040h

// Register: CIOCON
#define CIOCON CIOCON
CIOCON                                   equ 0F73h
// bitfield definitions
CIOCON_CANCAP_POSN                       equ 0004h
CIOCON_CANCAP_POSITION                   equ 0004h
CIOCON_CANCAP_SIZE                       equ 0001h
CIOCON_CANCAP_LENGTH                     equ 0001h
CIOCON_CANCAP_MASK                       equ 0010h
CIOCON_ENDRHI_POSN                       equ 0005h
CIOCON_ENDRHI_POSITION                   equ 0005h
CIOCON_ENDRHI_SIZE                       equ 0001h
CIOCON_ENDRHI_LENGTH                     equ 0001h
CIOCON_ENDRHI_MASK                       equ 0020h
CIOCON_TX1EN_POSN                        equ 0006h
CIOCON_TX1EN_POSITION                    equ 0006h
CIOCON_TX1EN_SIZE                        equ 0001h
CIOCON_TX1EN_LENGTH                      equ 0001h
CIOCON_TX1EN_MASK                        equ 0040h
CIOCON_TX1SRC_POSN                       equ 0007h
CIOCON_TX1SRC_POSITION                   equ 0007h
CIOCON_TX1SRC_SIZE                       equ 0001h
CIOCON_TX1SRC_LENGTH                     equ 0001h
CIOCON_TX1SRC_MASK                       equ 0080h
CIOCON_TX2EN_POSN                        equ 0006h
CIOCON_TX2EN_POSITION                    equ 0006h
CIOCON_TX2EN_SIZE                        equ 0001h
CIOCON_TX2EN_LENGTH                      equ 0001h
CIOCON_TX2EN_MASK                        equ 0040h
CIOCON_TX2SRC_POSN                       equ 0007h
CIOCON_TX2SRC_POSITION                   equ 0007h
CIOCON_TX2SRC_SIZE                       equ 0001h
CIOCON_TX2SRC_LENGTH                     equ 0001h
CIOCON_TX2SRC_MASK                       equ 0080h

// Register: COMSTAT
#define COMSTAT COMSTAT
COMSTAT                                  equ 0F74h
// bitfield definitions
COMSTAT_EWARN_POSN                       equ 0000h
COMSTAT_EWARN_POSITION                   equ 0000h
COMSTAT_EWARN_SIZE                       equ 0001h
COMSTAT_EWARN_LENGTH                     equ 0001h
COMSTAT_EWARN_MASK                       equ 0001h
COMSTAT_RXWARN_POSN                      equ 0001h
COMSTAT_RXWARN_POSITION                  equ 0001h
COMSTAT_RXWARN_SIZE                      equ 0001h
COMSTAT_RXWARN_LENGTH                    equ 0001h
COMSTAT_RXWARN_MASK                      equ 0002h
COMSTAT_TXWARN_POSN                      equ 0002h
COMSTAT_TXWARN_POSITION                  equ 0002h
COMSTAT_TXWARN_SIZE                      equ 0001h
COMSTAT_TXWARN_LENGTH                    equ 0001h
COMSTAT_TXWARN_MASK                      equ 0004h
COMSTAT_RXBP_POSN                        equ 0003h
COMSTAT_RXBP_POSITION                    equ 0003h
COMSTAT_RXBP_SIZE                        equ 0001h
COMSTAT_RXBP_LENGTH                      equ 0001h
COMSTAT_RXBP_MASK                        equ 0008h
COMSTAT_TXBP_POSN                        equ 0004h
COMSTAT_TXBP_POSITION                    equ 0004h
COMSTAT_TXBP_SIZE                        equ 0001h
COMSTAT_TXBP_LENGTH                      equ 0001h
COMSTAT_TXBP_MASK                        equ 0010h
COMSTAT_TXBO_POSN                        equ 0005h
COMSTAT_TXBO_POSITION                    equ 0005h
COMSTAT_TXBO_SIZE                        equ 0001h
COMSTAT_TXBO_LENGTH                      equ 0001h
COMSTAT_TXBO_MASK                        equ 0020h
COMSTAT_RXB1OVFL_POSN                    equ 0006h
COMSTAT_RXB1OVFL_POSITION                equ 0006h
COMSTAT_RXB1OVFL_SIZE                    equ 0001h
COMSTAT_RXB1OVFL_LENGTH                  equ 0001h
COMSTAT_RXB1OVFL_MASK                    equ 0040h
COMSTAT_RXB0OVFL_POSN                    equ 0007h
COMSTAT_RXB0OVFL_POSITION                equ 0007h
COMSTAT_RXB0OVFL_SIZE                    equ 0001h
COMSTAT_RXB0OVFL_LENGTH                  equ 0001h
COMSTAT_RXB0OVFL_MASK                    equ 0080h
COMSTAT_RX1OVFL_POSN                     equ 0006h
COMSTAT_RX1OVFL_POSITION                 equ 0006h
COMSTAT_RX1OVFL_SIZE                     equ 0001h
COMSTAT_RX1OVFL_LENGTH                   equ 0001h
COMSTAT_RX1OVFL_MASK                     equ 0040h
COMSTAT_RX0OVFL_POSN                     equ 0007h
COMSTAT_RX0OVFL_POSITION                 equ 0007h
COMSTAT_RX0OVFL_SIZE                     equ 0001h
COMSTAT_RX0OVFL_LENGTH                   equ 0001h
COMSTAT_RX0OVFL_MASK                     equ 0080h
COMSTAT_RXBNOVFL_POSN                    equ 0006h
COMSTAT_RXBNOVFL_POSITION                equ 0006h
COMSTAT_RXBNOVFL_SIZE                    equ 0001h
COMSTAT_RXBNOVFL_LENGTH                  equ 0001h
COMSTAT_RXBNOVFL_MASK                    equ 0040h
COMSTAT_FIFOEMPTY_POSN                   equ 0007h
COMSTAT_FIFOEMPTY_POSITION               equ 0007h
COMSTAT_FIFOEMPTY_SIZE                   equ 0001h
COMSTAT_FIFOEMPTY_LENGTH                 equ 0001h
COMSTAT_FIFOEMPTY_MASK                   equ 0080h

// Register: RXERRCNT
#define RXERRCNT RXERRCNT
RXERRCNT                                 equ 0F75h
// bitfield definitions
RXERRCNT_REC0_POSN                       equ 0000h
RXERRCNT_REC0_POSITION                   equ 0000h
RXERRCNT_REC0_SIZE                       equ 0001h
RXERRCNT_REC0_LENGTH                     equ 0001h
RXERRCNT_REC0_MASK                       equ 0001h
RXERRCNT_REC1_POSN                       equ 0001h
RXERRCNT_REC1_POSITION                   equ 0001h
RXERRCNT_REC1_SIZE                       equ 0001h
RXERRCNT_REC1_LENGTH                     equ 0001h
RXERRCNT_REC1_MASK                       equ 0002h
RXERRCNT_REC2_POSN                       equ 0002h
RXERRCNT_REC2_POSITION                   equ 0002h
RXERRCNT_REC2_SIZE                       equ 0001h
RXERRCNT_REC2_LENGTH                     equ 0001h
RXERRCNT_REC2_MASK                       equ 0004h
RXERRCNT_REC3_POSN                       equ 0003h
RXERRCNT_REC3_POSITION                   equ 0003h
RXERRCNT_REC3_SIZE                       equ 0001h
RXERRCNT_REC3_LENGTH                     equ 0001h
RXERRCNT_REC3_MASK                       equ 0008h
RXERRCNT_REC4_POSN                       equ 0004h
RXERRCNT_REC4_POSITION                   equ 0004h
RXERRCNT_REC4_SIZE                       equ 0001h
RXERRCNT_REC4_LENGTH                     equ 0001h
RXERRCNT_REC4_MASK                       equ 0010h
RXERRCNT_REC5_POSN                       equ 0005h
RXERRCNT_REC5_POSITION                   equ 0005h
RXERRCNT_REC5_SIZE                       equ 0001h
RXERRCNT_REC5_LENGTH                     equ 0001h
RXERRCNT_REC5_MASK                       equ 0020h
RXERRCNT_REC6_POSN                       equ 0006h
RXERRCNT_REC6_POSITION                   equ 0006h
RXERRCNT_REC6_SIZE                       equ 0001h
RXERRCNT_REC6_LENGTH                     equ 0001h
RXERRCNT_REC6_MASK                       equ 0040h
RXERRCNT_REC7_POSN                       equ 0007h
RXERRCNT_REC7_POSITION                   equ 0007h
RXERRCNT_REC7_SIZE                       equ 0001h
RXERRCNT_REC7_LENGTH                     equ 0001h
RXERRCNT_REC7_MASK                       equ 0080h

// Register: TXERRCNT
#define TXERRCNT TXERRCNT
TXERRCNT                                 equ 0F76h
// bitfield definitions
TXERRCNT_TEC0_POSN                       equ 0000h
TXERRCNT_TEC0_POSITION                   equ 0000h
TXERRCNT_TEC0_SIZE                       equ 0001h
TXERRCNT_TEC0_LENGTH                     equ 0001h
TXERRCNT_TEC0_MASK                       equ 0001h
TXERRCNT_TEC1_POSN                       equ 0001h
TXERRCNT_TEC1_POSITION                   equ 0001h
TXERRCNT_TEC1_SIZE                       equ 0001h
TXERRCNT_TEC1_LENGTH                     equ 0001h
TXERRCNT_TEC1_MASK                       equ 0002h
TXERRCNT_TEC2_POSN                       equ 0002h
TXERRCNT_TEC2_POSITION                   equ 0002h
TXERRCNT_TEC2_SIZE                       equ 0001h
TXERRCNT_TEC2_LENGTH                     equ 0001h
TXERRCNT_TEC2_MASK                       equ 0004h
TXERRCNT_TEC3_POSN                       equ 0003h
TXERRCNT_TEC3_POSITION                   equ 0003h
TXERRCNT_TEC3_SIZE                       equ 0001h
TXERRCNT_TEC3_LENGTH                     equ 0001h
TXERRCNT_TEC3_MASK                       equ 0008h
TXERRCNT_TEC4_POSN                       equ 0004h
TXERRCNT_TEC4_POSITION                   equ 0004h
TXERRCNT_TEC4_SIZE                       equ 0001h
TXERRCNT_TEC4_LENGTH                     equ 0001h
TXERRCNT_TEC4_MASK                       equ 0010h
TXERRCNT_TEC5_POSN                       equ 0005h
TXERRCNT_TEC5_POSITION                   equ 0005h
TXERRCNT_TEC5_SIZE                       equ 0001h
TXERRCNT_TEC5_LENGTH                     equ 0001h
TXERRCNT_TEC5_MASK                       equ 0020h
TXERRCNT_TEC6_POSN                       equ 0006h
TXERRCNT_TEC6_POSITION                   equ 0006h
TXERRCNT_TEC6_SIZE                       equ 0001h
TXERRCNT_TEC6_LENGTH                     equ 0001h
TXERRCNT_TEC6_MASK                       equ 0040h
TXERRCNT_TEC7_POSN                       equ 0007h
TXERRCNT_TEC7_POSITION                   equ 0007h
TXERRCNT_TEC7_SIZE                       equ 0001h
TXERRCNT_TEC7_LENGTH                     equ 0001h
TXERRCNT_TEC7_MASK                       equ 0080h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0F80h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_RA6_POSN                           equ 0006h
PORTA_RA6_POSITION                       equ 0006h
PORTA_RA6_SIZE                           equ 0001h
PORTA_RA6_LENGTH                         equ 0001h
PORTA_RA6_MASK                           equ 0040h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_AN2_POSN                           equ 0002h
PORTA_AN2_POSITION                       equ 0002h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0004h
PORTA_AN3_POSN                           equ 0003h
PORTA_AN3_POSITION                       equ 0003h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0008h
PORTA_AN4_POSN                           equ 0005h
PORTA_AN4_POSITION                       equ 0005h
PORTA_AN4_SIZE                           equ 0001h
PORTA_AN4_LENGTH                         equ 0001h
PORTA_AN4_MASK                           equ 0020h
PORTA_OSC2_POSN                          equ 0006h
PORTA_OSC2_POSITION                      equ 0006h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0040h
PORTA_VREFM_POSN                         equ 0002h
PORTA_VREFM_POSITION                     equ 0002h
PORTA_VREFM_SIZE                         equ 0001h
PORTA_VREFM_LENGTH                       equ 0001h
PORTA_VREFM_MASK                         equ 0004h
PORTA_VREFP_POSN                         equ 0003h
PORTA_VREFP_POSITION                     equ 0003h
PORTA_VREFP_SIZE                         equ 0001h
PORTA_VREFP_LENGTH                       equ 0001h
PORTA_VREFP_MASK                         equ 0008h
PORTA_T0CKI_POSN                         equ 0004h
PORTA_T0CKI_POSITION                     equ 0004h
PORTA_T0CKI_SIZE                         equ 0001h
PORTA_T0CKI_LENGTH                       equ 0001h
PORTA_T0CKI_MASK                         equ 0010h
PORTA_SS_POSN                            equ 0005h
PORTA_SS_POSITION                        equ 0005h
PORTA_SS_SIZE                            equ 0001h
PORTA_SS_LENGTH                          equ 0001h
PORTA_SS_MASK                            equ 0020h
PORTA_CLK0_POSN                          equ 0006h
PORTA_CLK0_POSITION                      equ 0006h
PORTA_CLK0_SIZE                          equ 0001h
PORTA_CLK0_LENGTH                        equ 0001h
PORTA_CLK0_MASK                          equ 0040h
PORTA_LVDIN_POSN                         equ 0005h
PORTA_LVDIN_POSITION                     equ 0005h
PORTA_LVDIN_SIZE                         equ 0001h
PORTA_LVDIN_LENGTH                       equ 0001h
PORTA_LVDIN_MASK                         equ 0020h
PORTA_ULPWUIN_POSN                       equ 0000h
PORTA_ULPWUIN_POSITION                   equ 0000h
PORTA_ULPWUIN_SIZE                       equ 0001h
PORTA_ULPWUIN_LENGTH                     equ 0001h
PORTA_ULPWUIN_MASK                       equ 0001h

// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0F81h
// bitfield definitions
PORTB_RB0_POSN                           equ 0000h
PORTB_RB0_POSITION                       equ 0000h
PORTB_RB0_SIZE                           equ 0001h
PORTB_RB0_LENGTH                         equ 0001h
PORTB_RB0_MASK                           equ 0001h
PORTB_RB1_POSN                           equ 0001h
PORTB_RB1_POSITION                       equ 0001h
PORTB_RB1_SIZE                           equ 0001h
PORTB_RB1_LENGTH                         equ 0001h
PORTB_RB1_MASK                           equ 0002h
PORTB_RB2_POSN                           equ 0002h
PORTB_RB2_POSITION                       equ 0002h
PORTB_RB2_SIZE                           equ 0001h
PORTB_RB2_LENGTH                         equ 0001h
PORTB_RB2_MASK                           equ 0004h
PORTB_RB3_POSN                           equ 0003h
PORTB_RB3_POSITION                       equ 0003h
PORTB_RB3_SIZE                           equ 0001h
PORTB_RB3_LENGTH                         equ 0001h
PORTB_RB3_MASK                           equ 0008h
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_INT0_POSN                          equ 0000h
PORTB_INT0_POSITION                      equ 0000h
PORTB_INT0_SIZE                          equ 0001h
PORTB_INT0_LENGTH                        equ 0001h
PORTB_INT0_MASK                          equ 0001h
PORTB_INT1_POSN                          equ 0001h
PORTB_INT1_POSITION                      equ 0001h
PORTB_INT1_SIZE                          equ 0001h
PORTB_INT1_LENGTH                        equ 0001h
PORTB_INT1_MASK                          equ 0002h
PORTB_INT2_POSN                          equ 0002h
PORTB_INT2_POSITION                      equ 0002h
PORTB_INT2_SIZE                          equ 0001h
PORTB_INT2_LENGTH                        equ 0001h
PORTB_INT2_MASK                          equ 0004h
PORTB_INT3_POSN                          equ 0003h
PORTB_INT3_POSITION                      equ 0003h
PORTB_INT3_SIZE                          equ 0001h
PORTB_INT3_LENGTH                        equ 0001h
PORTB_INT3_MASK                          equ 0008h
PORTB_CCP2_PA2_POSN                      equ 0003h
PORTB_CCP2_PA2_POSITION                  equ 0003h
PORTB_CCP2_PA2_SIZE                      equ 0001h
PORTB_CCP2_PA2_LENGTH                    equ 0001h
PORTB_CCP2_PA2_MASK                      equ 0008h

