GopalSaraf/Practicals/PSDL/include/proc/pic18c658.inc
// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0FA4h
// bitfield definitions
PIR3_RXB0IF_POSN                         equ 0000h
PIR3_RXB0IF_POSITION                     equ 0000h
PIR3_RXB0IF_SIZE                         equ 0001h
PIR3_RXB0IF_LENGTH                       equ 0001h
PIR3_RXB0IF_MASK                         equ 0001h
PIR3_RXB1IF_POSN                         equ 0001h
PIR3_RXB1IF_POSITION                     equ 0001h
PIR3_RXB1IF_SIZE                         equ 0001h
PIR3_RXB1IF_LENGTH                       equ 0001h
PIR3_RXB1IF_MASK                         equ 0002h
PIR3_TXB0IF_POSN                         equ 0002h
PIR3_TXB0IF_POSITION                     equ 0002h
PIR3_TXB0IF_SIZE                         equ 0001h
PIR3_TXB0IF_LENGTH                       equ 0001h
PIR3_TXB0IF_MASK                         equ 0004h
PIR3_TXB1IF_POSN                         equ 0003h
PIR3_TXB1IF_POSITION                     equ 0003h
PIR3_TXB1IF_SIZE                         equ 0001h
PIR3_TXB1IF_LENGTH                       equ 0001h
PIR3_TXB1IF_MASK                         equ 0008h
PIR3_TXB2IF_POSN                         equ 0004h
PIR3_TXB2IF_POSITION                     equ 0004h
PIR3_TXB2IF_SIZE                         equ 0001h
PIR3_TXB2IF_LENGTH                       equ 0001h
PIR3_TXB2IF_MASK                         equ 0010h
PIR3_ERRIF_POSN                          equ 0005h
PIR3_ERRIF_POSITION                      equ 0005h
PIR3_ERRIF_SIZE                          equ 0001h
PIR3_ERRIF_LENGTH                        equ 0001h
PIR3_ERRIF_MASK                          equ 0020h
PIR3_WAKIF_POSN                          equ 0006h
PIR3_WAKIF_POSITION                      equ 0006h
PIR3_WAKIF_SIZE                          equ 0001h
PIR3_WAKIF_LENGTH                        equ 0001h
PIR3_WAKIF_MASK                          equ 0040h
PIR3_IRXIF_POSN                          equ 0007h
PIR3_IRXIF_POSITION                      equ 0007h
PIR3_IRXIF_SIZE                          equ 0001h
PIR3_IRXIF_LENGTH                        equ 0001h
PIR3_IRXIF_MASK                          equ 0080h
PIR3_RXBNIF_POSN                         equ 0001h
PIR3_RXBNIF_POSITION                     equ 0001h
PIR3_RXBNIF_SIZE                         equ 0001h
PIR3_RXBNIF_LENGTH                       equ 0001h
PIR3_RXBNIF_MASK                         equ 0002h
PIR3_TXBNIF_POSN                         equ 0004h
PIR3_TXBNIF_POSITION                     equ 0004h
PIR3_TXBNIF_SIZE                         equ 0001h
PIR3_TXBNIF_LENGTH                       equ 0001h
PIR3_TXBNIF_MASK                         equ 0010h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 0FA5h
// bitfield definitions
IPR3_RXB0IP_POSN                         equ 0000h
IPR3_RXB0IP_POSITION                     equ 0000h
IPR3_RXB0IP_SIZE                         equ 0001h
IPR3_RXB0IP_LENGTH                       equ 0001h
IPR3_RXB0IP_MASK                         equ 0001h
IPR3_RXB1IP_POSN                         equ 0001h
IPR3_RXB1IP_POSITION                     equ 0001h
IPR3_RXB1IP_SIZE                         equ 0001h
IPR3_RXB1IP_LENGTH                       equ 0001h
IPR3_RXB1IP_MASK                         equ 0002h
IPR3_TXB0IP_POSN                         equ 0002h
IPR3_TXB0IP_POSITION                     equ 0002h
IPR3_TXB0IP_SIZE                         equ 0001h
IPR3_TXB0IP_LENGTH                       equ 0001h
IPR3_TXB0IP_MASK                         equ 0004h
IPR3_TXB1IP_POSN                         equ 0003h
IPR3_TXB1IP_POSITION                     equ 0003h
IPR3_TXB1IP_SIZE                         equ 0001h
IPR3_TXB1IP_LENGTH                       equ 0001h
IPR3_TXB1IP_MASK                         equ 0008h
IPR3_TXB2IP_POSN                         equ 0004h
IPR3_TXB2IP_POSITION                     equ 0004h
IPR3_TXB2IP_SIZE                         equ 0001h
IPR3_TXB2IP_LENGTH                       equ 0001h
IPR3_TXB2IP_MASK                         equ 0010h
IPR3_ERRIP_POSN                          equ 0005h
IPR3_ERRIP_POSITION                      equ 0005h
IPR3_ERRIP_SIZE                          equ 0001h
IPR3_ERRIP_LENGTH                        equ 0001h
IPR3_ERRIP_MASK                          equ 0020h
IPR3_WAKIP_POSN                          equ 0006h
IPR3_WAKIP_POSITION                      equ 0006h
IPR3_WAKIP_SIZE                          equ 0001h
IPR3_WAKIP_LENGTH                        equ 0001h
IPR3_WAKIP_MASK                          equ 0040h
IPR3_IRXIP_POSN                          equ 0007h
IPR3_IRXIP_POSITION                      equ 0007h
IPR3_IRXIP_SIZE                          equ 0001h
IPR3_IRXIP_LENGTH                        equ 0001h
IPR3_IRXIP_MASK                          equ 0080h
IPR3_RXBNIP_POSN                         equ 0001h
IPR3_RXBNIP_POSITION                     equ 0001h
IPR3_RXBNIP_SIZE                         equ 0001h
IPR3_RXBNIP_LENGTH                       equ 0001h
IPR3_RXBNIP_MASK                         equ 0002h
IPR3_TXBNIP_POSN                         equ 0004h
IPR3_TXBNIP_POSITION                     equ 0004h
IPR3_TXBNIP_SIZE                         equ 0001h
IPR3_TXBNIP_LENGTH                       equ 0001h
IPR3_TXBNIP_MASK                         equ 0010h

// Register: RCSTA
#define RCSTA RCSTA
RCSTA                                    equ 0FABh
// bitfield definitions
RCSTA_RX9D_POSN                          equ 0000h
RCSTA_RX9D_POSITION                      equ 0000h
RCSTA_RX9D_SIZE                          equ 0001h
RCSTA_RX9D_LENGTH                        equ 0001h
RCSTA_RX9D_MASK                          equ 0001h
RCSTA_OERR_POSN                          equ 0001h
RCSTA_OERR_POSITION                      equ 0001h
RCSTA_OERR_SIZE                          equ 0001h
RCSTA_OERR_LENGTH                        equ 0001h
RCSTA_OERR_MASK                          equ 0002h
RCSTA_FERR_POSN                          equ 0002h
RCSTA_FERR_POSITION                      equ 0002h
RCSTA_FERR_SIZE                          equ 0001h
RCSTA_FERR_LENGTH                        equ 0001h
RCSTA_FERR_MASK                          equ 0004h
RCSTA_ADDEN_POSN                         equ 0003h
RCSTA_ADDEN_POSITION                     equ 0003h
RCSTA_ADDEN_SIZE                         equ 0001h
RCSTA_ADDEN_LENGTH                       equ 0001h
RCSTA_ADDEN_MASK                         equ 0008h
RCSTA_CREN_POSN                          equ 0004h
RCSTA_CREN_POSITION                      equ 0004h
RCSTA_CREN_SIZE                          equ 0001h
RCSTA_CREN_LENGTH                        equ 0001h
RCSTA_CREN_MASK                          equ 0010h
RCSTA_SREN_POSN                          equ 0005h
RCSTA_SREN_POSITION                      equ 0005h
RCSTA_SREN_SIZE                          equ 0001h
RCSTA_SREN_LENGTH                        equ 0001h
RCSTA_SREN_MASK                          equ 0020h
RCSTA_RX9_POSN                           equ 0006h
RCSTA_RX9_POSITION                       equ 0006h
RCSTA_RX9_SIZE                           equ 0001h
RCSTA_RX9_LENGTH                         equ 0001h
RCSTA_RX9_MASK                           equ 0040h
RCSTA_SPEN_POSN                          equ 0007h
RCSTA_SPEN_POSITION                      equ 0007h
RCSTA_SPEN_SIZE                          equ 0001h
RCSTA_SPEN_LENGTH                        equ 0001h
RCSTA_SPEN_MASK                          equ 0080h
RCSTA_ADEN_POSN                          equ 0003h
RCSTA_ADEN_POSITION                      equ 0003h
RCSTA_ADEN_SIZE                          equ 0001h
RCSTA_ADEN_LENGTH                        equ 0001h
RCSTA_ADEN_MASK                          equ 0008h
RCSTA_SRENA_POSN                         equ 0005h
RCSTA_SRENA_POSITION                     equ 0005h
RCSTA_SRENA_SIZE                         equ 0001h
RCSTA_SRENA_LENGTH                       equ 0001h
RCSTA_SRENA_MASK                         equ 0020h
RCSTA_RC8_9_POSN                         equ 0006h
RCSTA_RC8_9_POSITION                     equ 0006h
RCSTA_RC8_9_SIZE                         equ 0001h
RCSTA_RC8_9_LENGTH                       equ 0001h
RCSTA_RC8_9_MASK                         equ 0040h
RCSTA_RC9_POSN                           equ 0006h
RCSTA_RC9_POSITION                       equ 0006h
RCSTA_RC9_SIZE                           equ 0001h
RCSTA_RC9_LENGTH                         equ 0001h
RCSTA_RC9_MASK                           equ 0040h
RCSTA_RCD8_POSN                          equ 0000h
RCSTA_RCD8_POSITION                      equ 0000h
RCSTA_RCD8_SIZE                          equ 0001h
RCSTA_RCD8_LENGTH                        equ 0001h
RCSTA_RCD8_MASK                          equ 0001h

// Register: TXSTA
#define TXSTA TXSTA
TXSTA                                    equ 0FACh
// bitfield definitions
TXSTA_TX9D_POSN                          equ 0000h
TXSTA_TX9D_POSITION                      equ 0000h
TXSTA_TX9D_SIZE                          equ 0001h
TXSTA_TX9D_LENGTH                        equ 0001h
TXSTA_TX9D_MASK                          equ 0001h
TXSTA_TRMT_POSN                          equ 0001h
TXSTA_TRMT_POSITION                      equ 0001h
TXSTA_TRMT_SIZE                          equ 0001h
TXSTA_TRMT_LENGTH                        equ 0001h
TXSTA_TRMT_MASK                          equ 0002h
TXSTA_BRGH_POSN                          equ 0002h
TXSTA_BRGH_POSITION                      equ 0002h
TXSTA_BRGH_SIZE                          equ 0001h
TXSTA_BRGH_LENGTH                        equ 0001h
TXSTA_BRGH_MASK                          equ 0004h
TXSTA_SYNC_POSN                          equ 0004h
TXSTA_SYNC_POSITION                      equ 0004h
TXSTA_SYNC_SIZE                          equ 0001h
TXSTA_SYNC_LENGTH                        equ 0001h
TXSTA_SYNC_MASK                          equ 0010h
TXSTA_TXEN_POSN                          equ 0005h
TXSTA_TXEN_POSITION                      equ 0005h
TXSTA_TXEN_SIZE                          equ 0001h
TXSTA_TXEN_LENGTH                        equ 0001h
TXSTA_TXEN_MASK                          equ 0020h
TXSTA_TX9_POSN                           equ 0006h
TXSTA_TX9_POSITION                       equ 0006h
TXSTA_TX9_SIZE                           equ 0001h
TXSTA_TX9_LENGTH                         equ 0001h
TXSTA_TX9_MASK                           equ 0040h
TXSTA_CSRC_POSN                          equ 0007h
TXSTA_CSRC_POSITION                      equ 0007h
TXSTA_CSRC_SIZE                          equ 0001h
TXSTA_CSRC_LENGTH                        equ 0001h
TXSTA_CSRC_MASK                          equ 0080h
TXSTA_TX9D1_POSN                         equ 0000h
TXSTA_TX9D1_POSITION                     equ 0000h
TXSTA_TX9D1_SIZE                         equ 0001h
TXSTA_TX9D1_LENGTH                       equ 0001h
TXSTA_TX9D1_MASK                         equ 0001h
TXSTA_TRMT1_POSN                         equ 0001h
TXSTA_TRMT1_POSITION                     equ 0001h
TXSTA_TRMT1_SIZE                         equ 0001h
TXSTA_TRMT1_LENGTH                       equ 0001h
TXSTA_TRMT1_MASK                         equ 0002h
TXSTA_BRGH1_POSN                         equ 0002h
TXSTA_BRGH1_POSITION                     equ 0002h
TXSTA_BRGH1_SIZE                         equ 0001h
TXSTA_BRGH1_LENGTH                       equ 0001h
TXSTA_BRGH1_MASK                         equ 0004h
TXSTA_SYNC1_POSN                         equ 0004h
TXSTA_SYNC1_POSITION                     equ 0004h
TXSTA_SYNC1_SIZE                         equ 0001h
TXSTA_SYNC1_LENGTH                       equ 0001h
TXSTA_SYNC1_MASK                         equ 0010h
TXSTA_TXEN1_POSN                         equ 0005h
TXSTA_TXEN1_POSITION                     equ 0005h
TXSTA_TXEN1_SIZE                         equ 0001h
TXSTA_TXEN1_LENGTH                       equ 0001h
TXSTA_TXEN1_MASK                         equ 0020h
TXSTA_TX91_POSN                          equ 0006h
TXSTA_TX91_POSITION                      equ 0006h
TXSTA_TX91_SIZE                          equ 0001h
TXSTA_TX91_LENGTH                        equ 0001h
TXSTA_TX91_MASK                          equ 0040h
TXSTA_CSRC1_POSN                         equ 0007h
TXSTA_CSRC1_POSITION                     equ 0007h
TXSTA_CSRC1_SIZE                         equ 0001h
TXSTA_CSRC1_LENGTH                       equ 0001h
TXSTA_CSRC1_MASK                         equ 0080h
TXSTA_TX8_9_POSN                         equ 0006h
TXSTA_TX8_9_POSITION                     equ 0006h
TXSTA_TX8_9_SIZE                         equ 0001h
TXSTA_TX8_9_LENGTH                       equ 0001h
TXSTA_TX8_9_MASK                         equ 0040h
TXSTA_TXD8_POSN                          equ 0000h
TXSTA_TXD8_POSITION                      equ 0000h
TXSTA_TXD8_SIZE                          equ 0001h
TXSTA_TXD8_LENGTH                        equ 0001h
TXSTA_TXD8_MASK                          equ 0001h

